Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: ཐེག་པ་མཆོག་ལ་གནས་ནས་དེ་ནི་སྐྱབས་འགྱུར་ཏེ། །
en: “Those who live by the supreme vehicle obtain protection.

source: ཚུལ་ཁྲིམས་ལྡན་ཞིང་ཚངས་པར་སྤྱོད་པས་ཡོངས་སུ་དག །
en: They are disciplined and their chaste conduct is pure.

source: ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཀྱིས་ནི་ཉི་ཟླ་འགོག །
en: They could stop the sun and moon with their discipline, asceticism, and hardships.

source: སྲིད་པ་དང་ནི་གཟུགས་དང་ལོངས་སྤྱོད་འདོད་མི་འགྱུར། །
en: They will not yearn for existence, physical forms , or wealth.

source: མི་སྙན་ཚིག་རྣམས་ཐོས་ཀྱང་མི་ཁྲོ་འཁྲུགས་མི་འགྱུར། །
en: “When they hear unpleasant words, it neither disturbs nor angers them.

source: ལུས་ནི་རྣམ་པར་གཏོར་ཀྱང་སེམས་ཅན་རྗེས་སུ་སྲུང་། །
en: Even if their bodies are broken apart, still they protect beings.

source: བདག་ལུས་རྙེད་སླ་ཆོས་ཀྱི་རྒྱལ་སྲིད་རྙེད་དཀའ་སྙམ། །
en: They feel that a body is easily acquired compared to the dominion of Dharma.

source: ཐེག་པ་མཆོག་གནས་བཟོད་པ་དག་པ་འདི་འདྲའོ། །
en: Such is the patience of those who live by the supreme vehicle.

source: བསྐལ་པ་བརྒྱ་ཕྲག་མཐའ་ཡས་ཇི་སྙེད་འཁོར་གྱུར་པ། །དེ་སྲིད་དུ་ཡང་ངན་སོང་རྣམས་སུ་འཁོར་བྱེད་ཅིང་། །
en: “For as long as the many infinite eons that beings spend in saṃsāra, They voluntarily circle through the lower realms.

source: སེམས་ཅན་བསྒྲལ་བའི་ཕྱིར་ནི་བརྩོན་འགྲུས་སྟོབས་བསྐྱེད་དེ། །
en: They arouse the strength of diligence in order to liberate beings.

source: ཐེག་པ་མཆོག་ལ་གནས་པའི་བརྩོན་འགྲུས་མཐུ་འདི་འདྲ། །
en: Such is the power of diligence of those who live by the supreme vehicle.

source: ཤིན་ཏུ་རབ་ཞི་མཉེན་དེས་བསམ་གཏན་ཆོ་ག་ཤེས། །འགྲོ་བ་རྣམས་ཀྱི་དོན་ཕྱིར་བྱམས་པའི་བསམ་གཏན་པ། །
en: “Absolutely peaceful, friendly, gentle, and masters of the systems of concentration, They concentrate on love for the sake of beings.

source: བསམ་གཏན་བདེ་བ་དེ་ལ་ནམ་ཡང་མི་ཆགས་ཏེ། །དྲན་དང་ལྡན་པ་འདྲེན་པ་རྣམས་ལ་བལྟ་བར་འདོད། །
en: Never attached to the bliss of concentration, These mindful beings yearn to see the guides.

source: ཆོས་རྣམས་ཐམས་ཅད་རྒྱུ་ལས་འབྱུང་ཞིང་སྟོང་པར་ཤེས། །དེ་ནི་བདག་དང་སེམས་ཅན་ཆོས་རྣམས་མི་དམིགས་ཏེ། །
en: “Knowing that all phenomena arise from causes and are empty, They do not observe either themselves, other beings, or phenomena.

source: ལྟ་བ་ཡོངས་དག་ཤེས་རབ་ལྡན་ཞིང་སེམས་ཀྱང་དུལ། །
en: Their view is pure, they are insightful, and their minds are tame.

source: ཐེག་པ་མཆོག་གནས་ཤེས་རབ་དག་པ་འདི་འདྲའོ། །
en: Such is the pure insight of those who live by the supreme vehicle.

source: གང་ཡང་བདེན་དང་ཚད་མེད་པ་དང་བསམ་གཏན་བཞི། །མངོན་ཤེས་ལྔ་དང་སངས་རྒྱས་ཀྱི་ནི་ཡང་དག་རིག །རྟོན་པ་བཞི་དང་ཆོས་ཀྱི་སྦྱིན་པ་དམ་པ་རྣམས། །
en: “The four truths, the four immeasurables, and the four concentrations, The five super-knowledges, the knowledge of the buddhas, The four reliances, and the sublime gift of the Dharma—

source: ཐམས་ཅད་སངས་རྒྱས་ཐེག་པ་དམ་པ་འདི་ལས་བྱུང་། །
en: All of these come from the buddhas’ sublime vehicle.

source: གང་གིས་མི་དབང་སངས་རྒྱས་སེང་གེའི་སྒྲ་སྒྲོགས་པ། །སྟོབས་བཅུའི་སངས་རྒྱས་ཆོས་རྣམས་མཐའ་ཡས་གང་ཡིན་དང་། །སྨིན་མཚམས་སྤུ་དང་སྤྱི་གཙུག་བལྟར་ནི་མི་མཐོང་བ། །
en: “Uttering the lion’s roar of the lord buddhas, And possessing the infinite qualities of buddhahood, such as the ten strengths, And the hair coil between the eyebrows, and the invisible crown—

source: ཐེག་པ་མཆོག་ལ་གནས་པས་རྙེད་པར་དཀའ་མ་ཡིན། །
en: All this is easily gained by the person who lives by the supreme vehicle.

source: གང་གིས་འགྲོ་བ་འདུལ་ཞིང་བསམ་པ་ཚིམ་བྱེད་པ། །རྒྱལ་བ་རྣམས་ཀྱི་ཆོ་འཕྲུལ་ཁྱད་འཕགས་གསུམ་གང་དང་། །ཐུབ་པའི་བསྟན་པ་གཞར་ཡང་དོན་མེད་མི་འགྱུར་བ། །
en: “Guiding beings and satisfying their wishes, And attaining the three noble miracles of the victors, And always putting the teachings of the Sage to good use—

source: དེ་དག་ཐེག་པ་མཆོག་ལ་གནས་པ་མྱུར་དུ་འཐོབ། །
en: All this is swiftly gained by the person who lives by the supreme vehicle.

source: འཇིག་རྟེན་ཀུན་ན་སྐད་ཀྱི་རྣམ་པ་ཇི་སྙེད་པ། །ཐམས་ཅད་སྟོབས་བཅུའི་གསུང་ནི་འཁྲུལ་པ་མེད་པ་དང་། །
en: “With the ten strengths of speech, such a person has no confusion About any of the languages in the world.

source: མཉེན་འཇམ་ཡིད་འོང་དོན་ལྡན་ཁ་ན་མ་ཐོ་མེད། །ཚངས་དང་མི་ཅིའི་དབྱངས་འདྲ་གསུང་རྒྱ་ཆེན་པོས་ཚིམ། །
en: Speaking in a manner that is friendly, gentle, pleasing, meaningful, and virtuous, Their speech satisfies like the voice of Brahmā and the kinnaras.

source: དེ་འདྲའི་སངས་རྒྱས་གསུང་ནི་མི་རིང་ཐོབ་འགྱུར་ཏེ། །ནམ་མཁའི་དཀྱིལ་ཚད་སངས་རྒྱས་ཞིང་རྣམས་གོ་བར་བྱེད། །
en: “In this manner they will soon attain buddha speech, And cause understanding to grow in buddha realms throughout space.

source: ཇི་སྙེད་ཅིག་གིས་ཆོས་དོན་ལྡན་པའི་ཚིག་ཐོས་པས། །ཀུན་གྱིས་ཉོན་མོངས་ཐམས་ཅད་བསལ་ནས་བདེ་བར་འགྱུར། །
en: Whoever hears their meaningful Dharma words Will discard their afflictions and find happiness.

source: རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནམ་མཁའི་མཐའ་མར་བགྲང་བར་ནུས། །ཕྱོགས་བཅུ་རྣམས་ཀྱི་རྒྱ་མཚོའི་ཆུ་ནི་ཚད་བྱར་ནུས། །
en: “Through the strength of miracles, one can measure the ends of space, And fathom the depths of the oceans in the ten directions.

source: སེམས་གཅིག་གིས་ནི་སེམས་ཅན་སྤྱོད་པ་མཐའ་ཡས་ཤེས། །
en: In a single moment of mind, the infinite conduct of beings can be known.

source: སངས་རྒྱས་ཐེག་པའི་ཡོན་ཏན་བརྗོད་པས་ཟད་མི་འགྱུར། །
en: Yet the qualities of the buddha vehicle cannot be fully expressed.”

source: ལེའུ་བརྒྱད་པའོ།། །།
en: Chapter Eight

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then addressed the bodhisattva Sāgaramati:

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཀུན་ཏུ་བསྲུང་བ་དང་། སྦ་བ་དང་། ཡུན་རིང་དུ་གནས་པར་བྱ་བ་དང་།
en: “Sāgaramati, thus a bodhisattva should retain the following entrance words, seal words, and vajra statements in order to protect, guard, and preserve this Dharma teaching;

source: བདག་གི་སེམས་ཡོངས་སུ་དགའ་བར་བྱ་བ་
en: so that they may delight their own minds;

source: དང་སེམས་ཅན་གཞན་དག་དང་གང་ཟག་གཞན་རྣམས་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པར་བྱ་བའི་ཕྱིར་སྒོའི་ཚིག་དང་།
en: and so that they may understand the faculties—supreme and otherwise—of other beings and people.

source: ཕྱག་རྒྱའི་ཚིག་དང་། རྡོ་རྗེའི་ཚིག་འདི་དག་གཟུང་བར་བྱའོ། །བཟུང་ནས་ཀྱང་བརྟག་པར་བྱའོ། །
en: Beyond retaining them, they should also examine them.

source: ཤེས་རབ་དང་རབ་ཏུ་ལྡན་པའི་སྦྱོར་བས་ངེས་པར་བསམ་པར་བྱའོ། །
en: They should carefully reflect on them with insightful engagement.

source: བློ་གྲོས་རྒྱ་མཚོ་སྒོའི་ཚིག་རྣམས་གང་ཞེ་ན།
en: “Sāgaramati, what are the entrance words?

source: འདི་ལྟ་སྟེ། རྣམ་པར་རིག་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའི་ཚིག་སྟེ། ཆོས་རྣམས་དབེན་པའི་དོན་དུ་སྟོན་ཏོ། །
en: Cognition is an entrance word for all phenomena, for it demonstrates that phenomena are void.

source: ཨ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་སྐྱེ་བ་མེད་པའི་དོན་དུ་སྟོན་ཏོ། །
en: A is an entrance for all phenomena, for it demonstrates that phenomena are unborn.

source: པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་དོན་དམ་པའི་དོན་དུ་སྟོན་ཏོ། །
en: Pa is an entrance for all phenomena, for it demonstrates that phenomena are ultimate.

source: ན་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་མིང་དང་གཟུགས་ཡོངས་སུ་ཤེས་པ་སྟོན་ཏོ། །
en: Na is an entrance for all phenomena, for it demonstrates knowledge of the name and form of phenomena.

source: ད་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་དུལ་བ་དང་ཞི་བ་ཉིད་དུ་སྟོན་ཏོ། །
en: Da is an entrance for all phenomena, for it demonstrates that phenomena are tame and peaceful.

source: ས་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཆགས་པ་ལས་ཤིན་ཏུ་འདས་པར་སྟོན་ཏོ། །
en: Sa is an entrance for all phenomena, for it demonstrates that phenomena transcend desire.

source: ཏཱ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་དེ་བཞིན་ཉིད་ཀྱི་རྗེས་སུ་འགྲོ་བ་སྟོན་ཏོ། །
en: Tā is an entrance for all phenomena, for it demonstrates that phenomena accord with suchness.

source: ཀ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དང་བྲལ་བར་སྟོན་ཏོ། །
en: Ka is an entrance for all phenomena, for it demonstrates that phenomena are devoid of karmic ripening.

source: ས་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་མཉམ་ཞིང་ཁྱད་པར་མེད་པར་སྟོན་ཏོ། །
en: Sa is an entrance for all phenomena, for it demonstrates that phenomena are the same and undifferentiated.

source: མ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་སྟོན་ཏོ། །
en: Ma is an entrance for all phenomena, for it demonstrates the great compassion of phenomena.

source: ག་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་ཉིད་སྟོན་ཏོ། །
en: Ga is an entrance for all phenomena, for it demonstrates that phenomena are subtle and difficult to fathom.

source: ཛ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་རྒ་ཤི་ལས་ཤིན་ཏུ་འདས་པར་སྟོན་ཏོ། །
en: Ja is an entrance for all phenomena, for it demonstrates that phenomena transcend aging and death.

source: དྷ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པར་སྟོན་ཏོ། །
en: Dha is an entrance for all phenomena, for it demonstrates the undifferentiated nature of the realm of phenomena in which phenomena are found.

source: ཤ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ལ་ཞི་གནས་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་སྟོན་ཏོ། །
en: Śa is an entrance for all phenomena, for it demonstrates that tranquility can be perfected with regard to phenomena.

source: ཁ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ནམ་མཁའ་དང་མཚུངས་པར་སྟོན་ཏོ། །
en: Kha is an entrance for all phenomena, for it demonstrates that phenomena are like space.

source: ཀྵ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཟད་པ་དང་མི་སྐྱེ་བར་བྱ་བར་སྟོན་ཏོ། །
en: Kṣa is an entrance for all phenomena, for it demonstrates the exhaustion and non-arising of phenomena.

source: ཛྙཱ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ལ་ཡེ་ཤེས་ཆགས་པ་མེད་པ་ཉིད་སྟོན་ཏོ། །
en: Jña is an entrance for all phenomena, for it demonstrates that wisdom is not attached to phenomena.

source: སྠ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་གནས་དང་གནས་མ་ཡིན་པ་ལ་མཁས་པ་སྟོན་ཏོ། །
en: Stha is an entrance for all phenomena, for it demonstrates skill in what is correct and incorrect about phenomena.

source: སྐ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་སྟོན་ཏོ། །
en: Ska is an entrance for all phenomena, for it demonstrates understanding of the aggregation of phenomena.

source: ཋ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་མཐར་ཐུག་པ་ཉིད་དུ་སྟོན་ཏོ། །
en: Ṭha is an entrance for all phenomena, for it demonstrates what is ultimate about phenomena.

source: ལུས་དབེན་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་འདོད་ཆགས་དང་བྲལ་བའི་མཐར་སྟོན་ཏོ། །
en: “ Physical isolation is an entrance for all phenomena, for it demonstrates the limit in which phenomena are free from attachment.

source: སེམས་དབེན་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་ཞེ་སྡང་དང་གཏི་མུག་འདུལ་བ་སྟོན་ཏོ། །
en: Mental isolation is an entrance for all phenomena, for it demonstrates the taming of phenomena’s aggression and stupidity.

source: ཉེ་བར་ཞི་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཆགས་པ་མེད་པ་ལ་རྟོན་པ་ཉིད་དུ་སྟོན་ཏོ། །
en: Peace is an entrance for all phenomena, for it demonstrates how phenomena are based on non-desire.

source: ཚུལ་བཞིན་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་འབྱུང་བའི་མཐའ་སྟོན་ཏོ། །
en: Accuracy is an entrance for all phenomena, for it demonstrates the limit of phenomena’s emergence.

source: གནས་པ་ཉིད་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་གནས་པར་སྟོན་ཏོ། །
en: Presence is an entrance for all phenomena, for it demonstrates the presence of the realm of phenomena in relation to phenomena.

source: ལེན་པ་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་དུ་སྟོན་ཏོ། །
en: Non-acquisition is an entrance for all phenomena, for it demonstrates phenomena’s characteristic of liberation.

source: ཡོངས་སུ་མི་འཛིན་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ལ་འཐབ་པ་དང་རྩོད་པ་འདོར་བར་སྟོན་ཏོ། །
en: Non-grasping is an entrance for all phenomena, for it demonstrates giving up struggle and debate about phenomena.

source: ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་རྣམ་པར་དག་པའི་མཚན་ཉིད་དུ་སྟོན་ཏོ། །
en: Absence of pollution is an entrance for all phenomena, for it demonstrates phenomena’s characteristic of purity.

source: རང་བཞིན་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་འོད་གསལ་བ་ཉིད་དུ་སྟོན་ཏོ། །
en: Nature is an entrance for all phenomena, for it demonstrates phenomena as luminosity.

source: སྣང་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་ཐམས་ཅད་གསལ་བ་ཉིད་དུ་སྟོན་ཏོ། །
en: Appearance is an entrance for all phenomena, for it demonstrates phenomena as lucidity.

source: བསྒོམ་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་འབྲེལ་བ་སྟོན་ཏོ། །
en: Familiarity is an entrance for all phenomena, for it demonstrates relationships between phenomena.

source: གཞི་མེད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་འདྲེས་པ་མེད་པ་ཉིད་དུ་སྟོན་ཏོ། །
en: Groundlessness is an entrance for all phenomena, for it demonstrates that phenomena are undifferentiated.

source: བྱང་ཆུབ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་དང་མཉམ་པ་ཉིད་དུ་སྟོན་ཏོ། །
en: Awakening is an entrance for all phenomena, for it demonstrates phenomena as sameness.

source: མྱ་ངན་ལས་འདས་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་སྟེ། ཆོས་རྣམས་ཀྱི་ཕུང་པོ་ཐམས་ཅད་སོ་སོར་འདོར་བར་སྟོན་ཏོ། །
en: Nirvāṇa is an entrance for all phenomena, for it demonstrates individual relinquishing of all phenomenal aggregations.

source: བློ་གྲོས་རྒྱ་མཚོ་སྒོའི་ཚིག་འདི་དག་ནི་རང་གི་སེམས་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །
en: Sāgaramati, these entrance words purify one’s mind.

source: སེམས་ཅན་གཞན་དག་དང་གང་ཟག་གཞན་རྣམས་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པར་འགྱུར་བའོ། །
en: They bring knowledge of other beings’ and peoples’ faculties—supreme and otherwise.

source: བློ་གྲོས་རྒྱ་མཚོ་ཕྱག་རྒྱའི་ཚིག་དེ་དག་གང་ཞེ་ན།
en: “What are the seal words, Sāgaramati?

source: འདི་ལྟ་སྟེ། བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་གྲོལ་བའི་ཕྱག་རྒྱས་བཏབ་པ་སྟེ། གཉིས་སུ་མེད་ཅིང་གཉིས་ཡོངས་སུ་དག་པའོ། །
en: All phenomena are sealed by liberation, Sāgaramati, for they are nondual and free from duality.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་མཐའ་དང་མཐའ་ཡས་པ་དང་མཐའ་མེད་པ་ལས་རྣམ་པར་གྲོལ་བའི་ཕྱག་རྒྱས་བཏབ་པ་སྟེ། ཆད་པ་དང་རྟག་པ་ཡོངས་སུ་དག་པའོ། །
en: Sāgaramati, all phenomena are sealed by freedom from being limited, infinite, and unlimited, for they are beyond eternalism and nihilism.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཟད་པ་དང་འདོད་ཆགས་དང་བྲལ་བའི་ཕྱག་རྒྱས་བཏབ་པ་སྟེ། ཟད་པའི་སྒོ་ཟད་པའི་མཐའ་ཟད་པའི་མུར་ཐུག་པའོ། །
en: Sāgaramati, all phenomena are sealed by freedom from exhaustion and attachment, for they reach the entrance, limit, and end of exhaustion.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་གདེག་པ་མེད་ཅིང་གཞག་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པ་སྟེ། མཉམ་པ་ཉིད་ཀྱི་མཐའ་ཡོངས་སུ་དག་པའོ། །
en: Sāgaramati, all phenomena are sealed by the absence of lifting up or putting down, for their limit of sameness is pure.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའི་ཕྱག་རྒྱས་བཏབ་པ་སྟེ། མིག་ལྔའི་ལམ་ལས་ཤིན་ཏུ་འདས་པའོ། །
en: Sāgaramati, all phenomena are sealed by space, for they transcend what can be seen with the five eyes.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་དང་ནམ་མཁའི་དབྱིངས་ཀྱི་ཕྱིར་ནམ་མཁའི་དཀྱིལ་གྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: “Sāgaramati, all phenomena are sealed by space because of the realm of phenomena and the expanse of space.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་འདུ་བའི་ཕྱིར་འདྲེས་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by being undifferentiated, because they are contained within the realm of phenomena.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཆོས་འདྲེས་པ་མེད་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the realm of phenomena because of the characteristic that phenomena are undifferentiated.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐར་དེ་བཞིན་ཉིད་ཀྱི་ཕྱིར་དེ་བཞིན་ཉིད་ཀྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by suchness because of the suchness of the past and future.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་གདོད་མ་ནས་ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཡང་དག་པའི་མཐའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the limit of reality because they are primordially pure.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་འདུས་བྱས་དང་འདུས་མ་བྱས་མཉམ་ཞིང་མཚུངས་པའི་ཕྱིར་སྟོང་པ་ཉིད་ཀྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: “Sāgaramati, all phenomena are sealed by emptiness because conditioned and unconditioned phenomena are equal and alike.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་དམིགས་པ་ཐ་དད་པ་དང་བྲལ་བའི་ཕྱིར་མཚན་མ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by signlessness because they are free of discrete reference points.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་སྨོན་ལམ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་སྨོན་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by wishlessness because they are devoid of any aspirations.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་ངོ་བོ་ཉིད་མེད་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་མི་རྟག་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: “Sāgaramati, all phenomena are sealed by impermanence because of their quality of lacking an essential nature.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཕུང་པོ་ལྔར་ཡོངས་སུ་བསྡུ་བའི་མཚན་ཉིད་ཀྱི་ཕྱིར་སྡུག་བསྔལ་གྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by suffering because of their quality of being subsumed within the five aggregates.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་བདག་མེད་པའི་ཕྱིར་བ་དག་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by selflessness because they are naturally devoid of self.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་མི་གཡོ་བའི་ཕྱིར་ཞི་བའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by peace because they are absolutely still.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་དོན་དམ་པའི་བདེན་པར་ཡང་དག་པར་འདུ་བའི་ཕྱིར་བདེན་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: “Sāgaramati, all phenomena are sealed by truth because they are all subsumed within ultimate truth.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ས་བོན་མི་གནས་པའི་ཕྱིར་དྲི་མ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by immaculateness because their seeds do not remain.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་ཐུག་པའི་ཕྱིར་མི་འཁྲུགས་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by being undisturbed because they come into contact.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཇི་ལྟ་བ་བཞིན་གྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the natural state because they are free from past and future.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ཁམས་གསུམ་ཐམས་ཅད་རོ་གཅིག་པའི་ཕྱིར་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the sameness of the three times because of the single taste of the three realms.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་འབྱུང་བ་མེད་པའི་ཕྱིར་མི་འབྱུང་བའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by being non-arising because it is their nature not to arise.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྐྱེ་བ་མེད་པའི་ཕྱིར་འགོག་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by being unceasing because they are unborn by their very nature.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་ང་རྒྱལ་གྱིས་ལྷག་པར་བྱེད་པ་ལྷག་པར་མི་བྱེད་པའི་ཕྱིར་སྒྲོ་འདོགས་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by a lack of exaggeration because they are not affected by arrogant assumptions.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ཀུན་ཏུ་རྒྱུ་བ་མེད་པའི་ཕྱིར་སྤྲོས་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the absence of conceptual elaboration because they are free of any motion of thoughts.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་གཟུགས་མེད་ཅིང་བསྟན་དུ་མེད་པའི་ཕྱིར་མཚན་གྱིས་མཚན་བཏབ་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the inapplicability of names because they are without form or anything that can be pointed out.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་གཞི་ཡང་དག་པར་རབ་ཏུ་ཆད་པའི་ཕྱིར་གོས་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by being unstained because the ground is absolutely discontinuous.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་གཉེན་པོ་མི་དམིགས་པའི་ཕྱིར་སྐྱོན་དུ་བྱ་བ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by a lack of faults because no antidotes are apprehended.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་མངོན་པར་འདུ་བྱ་བ་ཐམས་ཅད་མེད་པའི་ཕྱིར་ལས་མེད་ཅིང་རྣམ་པར་སྨིན་པ་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by a lack of karma and its ripening because there are no formations.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་སྐྱེ་བ་དང་གནས་པ་དང་བྲལ་བའི་ཕྱིར་འདུས་མ་བྱས་ཀྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the unconditioned because they are free from being born or enduring.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི། ནམ་མཁའི་དཀྱིལ་དང་བྱེ་བྲག་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: Sāgaramati, all phenomena are sealed by the sameness of all phenomena because they are indistinguishable from the sphere of space.

source: བློ་གྲོས་རྒྱ་མཚོ་ཕྱག་རྒྱའི་ཚིག་དེ་དག་ནི་ཕྱག་རྒྱའི་ཚིག་གང་དག་གིས་འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་ཕྱག་རྒྱས་བཏབ་པ་སྟེ། ཕྱག་རྒྱའི་ཚིག་དེ་དག་གིས་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕྱག་རྒྱས་བཏབ་པའོ། །
en: “Sāgaramati, these seal words represent the seal of the awakening of the blessed buddhas of the past, present, and future, and the eighty-four thousand sections of the Dharma.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་ཕྱག་རྒྱ་དེ་ལྟ་བུས་བཏབ་ན་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱར་ཡང་དག་པར་འདུ་སྟེ་མྱུར་དུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་འཐོབ་པའོ། །
en: Sāgaramati, if bodhisattvas apply this type of seal, they will be sealed by the thus-gone ones’ wisdom and swiftly attain the acceptance that phenomena are unborn.

source: བློ་གྲོས་རྒྱ་མཚོ་ཕྱག་རྒྱའི་ཚིག་དེ་དག་ནི་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ཀྱི་རྣ་ལམ་དུ་གྲག་པར་མི་འགྱུར་རོ། །
en: Sāgaramati, beings who have not developed roots of virtue will not hear these seal words.

source: འདིར་བདུད་ཀྱི་ལས་ཐམས་ཅད་ཚར་བཅད་དོ། །
en: They defeat all the works of the māras.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་གང་ཡིན་པ་དེ་ཡང་ཕྱག་རྒྱའི་ཚིག་འདི་ཉིད་དུ་འདུ་སྟེ་རྗེས་སུ་ཞུགས་སོ། །
en: Sāgaramati, even the Dhāraṇī of the Inexhaustible Casket that contains all Dharmas is contained within and accords with these seal words.

source: བློ་གྲོས་རྒྱ་མཚོ་ཏིང་ངེ་འཛིན་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་གང་ཡིན་པ་དེ་དག་ཀྱང་ཕྱག་རྒྱའི་ཚིག་འདི་ཉིད་དུ་འདུ་སྟེ་རྗེས་སུ་ཞུགས་སོ། །
en: Sāgaramati, eighty-four thousand absorptions and eighty-four thousand perfections that influence beings’ conduct are all contained within and accord with these seal words.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་རྡོ་རྗེའི་ཚིག་དེ་དག་གང་ཞེ་ན།
en: “Sāgaramati, what then are the vajra statements?

source: འདི་ལྟ་སྟེ། རང་བཞིན་གྱིས་འདྲེས་པ་མེད་པའི་ཕྱིར་འཇིག་ཚོགས་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: Transitory collection is a vajra statement because it is undifferentiated by its very nature.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་ལྟ་བ་ཐམས་ཅད་ངེས་པར་རྟོགས་པར་འགྱུར་བའོ། །
en: This vajra statement realizes all views with certainty.

source: རིག་པ་ལ་འཇུག་པའི་ཕྱིར་མ་རིག་པ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: Unknowing is a vajra statement because it creates knowing.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་ལྷག་པར་དམིགས་པའི་དངོས་པོ་ཡོངས་སུ་ཤེས་པར་འགྱུར་བའོ། །
en: This vajra statement brings understanding of observed objects.

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་མཚམས་མེད་པའི་མཐའ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: Unbounded limit is a vajra statement because it is noncomposite and sameness.

source: རྡོ་རྗེའི་ཚིག་འདི་ནི་མངོན་པར་འདུ་བྱེད་པ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་འགྱུར་བའོ། །
en: This vajra statement brings understanding of all conditioned things.

source: འདོད་ཆགས་དང་བྲལ་བའི་མཐའ་དང་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་འདོད་ཆགས་ཀྱི་མཐའ་ནི་རྡོ་རྗེའི་ཚིག་སྟེ།
en: Limit of attachment is a vajra statement because it is equal to the limit of the absence of attachment.
